Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ། རེ་ཞིག་རྒྱལ་པོ་སྡིག་ཅན་དེས་ཕ་ཆོས་ཀྱི་རྒྱལ་པོ་ཆོས་དང་ལྡན་པ་བསད་ན། དེས་ཀྱང་མ་ཆོག་ནས་བཅོམ་ལྡན་འདས་ལྷ་དང་ལྷ་མ་ཡིན་དང་། མི་རྣམས་ཀྱིས་མཆོད་པ་དེ་ལ་ཡང་བཀུར་སྟི་མ་ཡིན་པ་བྱས་ཏེ།
en: They thought, “For the time being, that sinful king, after having killed his father who was a righteous Dharma king, is not content and has performed disrespectful acts toward the Blessed One, who is venerated by gods, asuras, and humans.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་བཀུར་སྟི་མ་ཡིན་པས་བསྙེངས་པ་ཡིན་པས།
en: Since the buddhas, the blessed ones, are concerned about disrespectful acts, the Blessed One left Rājagṛha and arrived in Śrāvastī.

source: དེས་ན་བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ནས་གཤེགས་ཏེ་མཉན་ཡོད་དུ་བྱོན་པར་གྱུར་པས་དེ་ཡོང་ཡེ་རྒྱལ་སྲིད་ལས་དབྱུང་བར་བྱའོ་སྙམ་ནས་དེ་དག་གིས་ཕན་ཚུན་ཕོ་ཉས་བཟླུགས་ནས་བློ་གྲོས་གཅིག་ཏུ་བྱས་ཏེ་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་གོ་བསྐོན་པ་གླང་པོ་ཆེའི་ཚོགས་དང་། རྟ་པའི་ཚོགས་དང་། ཤིང་རྟའི་ཚོགས་དང་། དཔུང་བུ་ཆུང་གི་ཚོགས་དང་། རྒྱལ་པོའི་ཁབ་ཏུ་དོང་སྟེ།
en: Therefore, by whatever means, we shall dethrone him.” They sent messengers to each other and unified their efforts, prepared an army consisting of four divisions, and set off for Rājagṛha with an elephant division, a horse division, a chariot division, and an infantry division.

source: ལོ་བཅོམ་ནས་ཕྲུ་མར་བསྐོར་ཏེ་འཁོད་དོ།
en: They damaged the crops and camped around the city.

source: །ཀླུའི་རྒྱལ་པོ་སོག་མ་མེད་ཀྱིས་ཀྱང་སེར་བའི་རྒྱུན་ཕབ་པས་ལོ་ཏོག་ལྷག་མ་རྣམས་མ་རུང་བར་བྱས་སོ།
en: The nāga king Apalāla also damaged other crops by causing hail.

source: །དཀའ་ཐུབ་ཀྱི་ཆུ་ལྔ་བརྒྱ་དང་། ཆུ་མིག་དང་། མཚོ་དང་། མཚེའུ་རྣམས་སྐམས་ལ་ཐུག་པས་མུ་གེ་བྱུང་བར་གྱུར་ཏོ།
en: Because the five hundred hot springs, fountains, lakes, and ponds had dried up, there was a famine.

source: །ཆུ་ལྷག་མ་གཞན་དག་ཀྱང་མཐའི་རྒྱལ་ཕྲན་དག་གིས་མ་རུང་བར་བྱས་སོ།
en: The rest of the water supply was polluted with poison by the neighboring minor kings.

source: །དེ་ནས་མ་སྐྱེས་དགྲ་སྡུག་བསྔལ་མི་བཟད་པ་ཉམ་ང་བར་གྱུར་པ་ལ་མི་མ་ཡིན་པ་དག་གིས་གླགས་རྙེད་དེ། རྨ་ལ་ཐལ་བ་བཏབ་པ་ལྟར་མི་ངས་བྱུང་སྟེ། ཁྱོགས་དང་ཁྱོགས་འདྲུད་པར་གྱུར་ཏོ།
en: Then, as if throwing ash on the wound of Ajātaśatru, who could not bear his pain and was frightened, nonhuman beings took the opportunity to cause an epidemic, and then funeral biers jostled with one another.

source: །དེ་ནས་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་གནོད་པ་བརྒྱ་ཕྲག་དུ་མས་སྙིང་དཀྲུགས་པས་ལག་པ་འགྲམ་པ་ལ་གཏད་དེ་སེམས་ཁོང་དུ་ཆུད་ཅིང་འདུག་གོ།
en: King Ajātaśatru, his mind confused by the hundreds of losses, was plunged into grief, resting his cheek on his hand.

source: །དེ་ནས་ལུས་འཕགས་མས་སྨྲས་པ། བུ་ཅིའི་ཕྱིར་སེམས་ཁོང་དུ་ཆུད།
en: Vaidehī asked him, “My son, why are you plunged into grief?”

source: ཡུམ་གནོད་པ་བརྒྱ་ཕྲག་དུ་མ་དག་བྱུང་བར་གྱུར་ཏོ།
en: “Mother, I have suffered hundreds of losses.”

source: །བུ་ཁོ་མོས་སྔར་ཁྱོད་ལ་བཅོམ་ལྡན་འདས་ལ་བཀུར་སྟི་མ་ཡིན་པ་མ་བྱེད་ཅིག། །།འདུལ་བ་གཞི། བམ་པོ་ཉི་ཤུ་དྲུག་པ།
en: “My son, did I not once tell you, ‘Do not perform disrespectful acts toward the Blessed One.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་བཀུར་སྟི་མ་ཡིན་པས་བསྙེངས་པ་ཡིན་གྱིས། བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ནས་བཞུད་དེ་གནོད་པར་གྱུར་ཏ་རེ་ཞེས་མ་སྨྲས་སམ།
en: Since the buddhas, the blessed ones, are concerned about disrespectful acts, the Blessed One will leave Rājagṛha, which is bound to be a loss for us’?

source: དེ་ནི་འདི་ཡིན་ནོ།
en: That’s why!”

source: །ཡུམ་དེ་ལ་ཇི་ལྟར་བསྒྲུབ་པར་བགྱི།
en: “Mother, what should I do about it?”

source: བུ་བཅོམ་ལྡན་འདས་ལ་བཟོད་པར་གསོལ་ཅིག །ཡུམ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་མཆིས་པའི་རྔོ་མི་ཐོག་ལགས་སོ།
en: “My son, beg the Blessed One for forgiveness.” “Mother, I cannot go into the presence of the Blessed One.”

source: །བུ་ཁྱོད་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཙན་དན་དང་སྟེའུར་མཉམ་པ་ཁོང་ཁྲོ་བ་དང་རྗེས་སུ་ཆགས་པ་སྤངས་པ་ཡིན་ནོ་ཞེས་མ་ཐོས་སམ།
en: “My son, have you not heard that the buddhas, the blessed ones, accept being cut by an adze and being anointed with sandal paste as the same, and have abandoned anger and attachment?

source: གལ་ཏེ་འགའ་ཞིག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་ཕྱག་དཔུང་པ་གཅིག་ལ་སྟེའུ་ཡིས་བཞོག་པར་བྱེད་ལ། ཅིག་ཤོས་ལ་ཙན་དན་ས་མཆོག་གིས་ཉུག་པར་བྱེད་ན། དེ་ལ་བཅོམ་ལྡན་འདས་རྗེས་སུ་ཆགས་པ་ཡང་མི་མངའ། ཁོང་ཁྲོ་བ་ཡང་མི་མངའོ།
en: If one cut the Blessed One’s arm with an adze and anointed his other arm with gośīrṣacandana, the Blessed One would feel neither attachment nor anger toward him.”

source: །དེ་ནས་ལུས་འཕགས་མའི་བུ་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་མི་ཞིག་ལ་སྨྲས་པ། ཀྱེ་ནང་རྗེ་ཚུར་ཤོག །ཁྱོད་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་ལ།
en: Then King Ajātaśatru, son of Vaidehī, ordered a man, “Go now to the Blessed One.

source: སོན་ནས་ཁོ་བོའི་ཚིག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་བྱས་ཏེ་གནོད་པ་ཆུང་ངམ། ཉམ་ང་བ་ཉུང་ངམ། བསྐྱོད་པ་ཡང་ངམ། འཚོའམ། གནོད་པ་མི་མངའ་འམ།
en: When you arrive, bow low on my behalf until your forehead touches the Blessed One’s feet, and ask if the Blessed One is free from trouble, free from illness, in good physical condition, healthy, without any trouble, and living in vigor and comfort.

source: སྟོབས་དང་བདེ་བ་ལ་རེག་པར་བཞུགས་སམ་ཞེས་སྙུན་གསོལ་ལ་འདི་སྐད་ཅེས་ཀྱང་གསོལ་ཅིག །བཙུན་པ་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲའི་མཆིད་ནས་བཙུན་པ་བུ་ངན་པ་ནི་མཆིས་ཀྱི་ཕ་ངན་པ་ནི་མ་མཆིས་པས་བཅོམ་ལྡན་འདས་ཐུགས་བརྩེ་བ་ཉེ་བར་བཟུང་སྟེ་རྒྱལ་པོའི་ཁབ་ཏུ་གཤེགས་པར་གསོལ།
en: Then say, ‘Honored One, this is a message from Ajātaśatru, the king of Magadha, son of Vaidehī: “Honored One, though there is a bad son, there is no bad father. So, may the Blessed One have compassion and come to Rājagṛha.

source: གལ་ཏེ་བཅོམ་ལྡན་འདས་མ་གཤེགས་ན་རིང་པོ་མི་ཐོགས་པ་ཁོ་ནར་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་སྟོངས་ཏེ་མིང་ལུས་པར་འགྱུར་རོ་ཞེས་གསོལ་ཅིག །ལྷ་བཀའ་བཞིན་འཚལ་ཞེས་མི་དེས་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲའི་ལྟར་མཉན་ནས་ཆས་ཏེ་རིམ་གྱིས་མཉན་ཡོད་དུ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: If the Blessed One does not come, the city of Rājagṛha will soon be uninhabited, retaining only its name.” ’ ” “Certainly, Your Majesty,” replied the man to Ajātaśatru, the king of Magadha, and departed. The man in due course arrived in Śrāvastī and went to the Blessed One. When he arrived, he bowed low until his forehead touched the Blessed One’s feet, and then he sat down to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་མི་དེས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། གནོད་པ་ཆུང་ངམ། ཉམ་ང་བ་ཉུང་ངམ་ཞེས་བྱ་བ་ནས་རེག་པར་བཞུགས་སམ་ཞེས་སྙུན་གསོལ་ལགས་སོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: When he had sat down to one side, the man said to the Blessed One, “Honored One, King Ajātaśatru, son of Vaidehī, bows low until his forehead touches the Blessed One’s feet, and asks if the Blessed One is free from trouble, free from illness . . . and living in vigor and comfort.”

source: །ཀྱེ་མི་ཁྱོད་དང་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་བདེ་བར་གྱུར་ཅིག །བཙུན་པ་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲའི་མཆིད་ནས་བཙུན་པ་བུ་ངན་པ་ནི་མཆིས་ཀྱི་ཕ་ངན་པ་ནི་མ་མཆིས་པས་བཅོམ་ལྡན་འདས་ཐུགས་བརྩེ་བ་ཉེ་བར་བཟུང་སྟེ་རྒྱལ་པོའི་ཁབ་ཏུ་གཤེགས་སུ་གསོལ།
en: “I hope you and Ajātaśatru, the king of Magadha, son of Vaidehī, are living in comfort, too.” “Honored One, this is a message from Ajātaśatru, the king of Magadha, son of Vaidehī: ‘Honored One, though there is a bad son, there is no bad father. So, may the Blessed One have compassion and come to Rājagṛha.

source: གལ་ཏེ་བཅོམ་ལྡན་འདས་མ་གཤེགས་ན་ཞེས་བྱ་བ་ནས་མིང་ལུས་པར་འགྱུར་རོ། །ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: If the Blessed One does not come, the city of Rājagṛha will soon be uninhabited, retaining only its name.’ ”

source: །བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བས་མི་དེ་ལ་གནང་ངོ་།
en: The Blessed One assented to the man by remaining silent.

source: །དེ་ནས་མི་དེས་བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་སོང་ངོ་།
en: Then the man, knowing that the Blessed One had assented by remaining silent, departed from the Blessed One’s presence.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཇི་སྲིད་བཞེད་ཀྱི་བར་དུ་མཉན་ཡོད་དུ་བཞུགས་ནས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་རྒྱལ་པོའི་ཁབ་གང་ན་བ་དེར་རྒྱུ་ཞིང་གཤེགས་ཏེ།
en: Thereafter the Blessed One stayed in Śrāvastī as long as he wished, and then traveled toward Rājagṛha with the community of disciples.

source: རིམ་གྱིས་རྒྱུ་ཞིང་གཤེགས་པ་ན་ཡུལ་མ་ག་དྷཱར་བྱོན་ཏོ།
en: In due course, he arrived in the country of Magadha.

source: །བཅོམ་ལྡན་འདས་ཀྱི་མཐུས་རླུང་གཏོང་བའི་ལྷའི་བུ་རྣམས་ཀྱིས་ནི་དུག་གིས་མ་རུང་བར་བྱས་པའི་ཆུ་དེ་དག་བསྐམས་སོ།
en: By the power of the Blessed One, the gods who send wind dried up the waters that had been polluted with poison.

source: །ཆར་པ་འབེབས་པའི་ལྷའི་བུ་རྣམས་ཀྱིས་ནི་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ཆུས་བཀང་ངོ་།
en: The gods who bring rain filled the land with water of the eight good qualities.

source: །ལྷ་རྣམས་ནི་ཆར་པ་འབེབས་པ་ལ་ཞུགས་སོ།
en: The gods brought rain.

source: །སངས་རྒྱས་ལ་མངོན་པར་དད་པའི་ལྷ་རྣམས་ཀྱིས་ནི་རྒྱལ་པོའི་ཁབ་ནས་མི་མ་ཡིན་པ་རྣམས་བསྐྲད་ནས་མི་ངས་ཞི་བར་གྱུར་ཏོ།
en: The gods who have faith in the Buddha expelled the nonhuman beings from Rājagṛha and the epidemic ceased.

source: །མཐའི་རྒྱལ་ཕྲན་དག་གིས་ནི་བཅོམ་ལྡན་འདས་གཤེགས་པ་མཐོང་ནས་གྲོང་ཁྱེར་བསྐོར་བ་བཏང་སྟེ་དོང་ངོ་།
en: When the neighboring minor kings heard that the Blessed One had come, they ended their siege of the city and left.

source: །ཚོང་པ་རྣམས་ཀྱིས་ནི་ཟོང་དག་བཀྲམ་མོ།
en: Merchants displayed their merchandise.

source: །བཟོ་ཕལ་པ་གཞན་དག་གིས་ནི་རང་རང་བྱེད་པར་བརྩམས་སོ།
en: Each craftsman began to work.

source: །ཡུལ་སོ་སོ་ན་གནས་པའི་ཚོང་པ་རྣམས་དང་། དེད་དཔོན་རྣམས་ནི་ཟོང་དང་འཇུག་པར་བརྩམས་སོ།
en: Merchants and caravan leaders living in each country began to enter Rājagṛha bringing their merchandise.

source: །ལོ་ནི་ལེགས་པར་གྱུར་ཏོ།
en: The harvest became abundant.

source: །ལམ་པོ་ཆེ་དང་སྲང་དང་། སུམ་མདོ་དང་། བཞི་མདོ་རྣམས་སུ་ནི་བཅོམ་ལྡན་འདས་ཀྱི་བདག་ཉིད་ཆེན་པོ་སྒྲོགས་པར་གྱུར་ཏོ།
en: The great state of the Blessed One was proclaimed in wide streets, in small streets, at three-forked roads, and at crossroads.

source: །མུ་སྟེགས་པ་རྣམས་ནི་བག་འཁུམས་པར་གྱུར་ཏོ།
en: Non-Buddhist ascetics became timid.

source: །སྐྱེ་བོའི་ཚོགས་རྣམས་ནི་རབ་ཏུ་དགའ་བར་གྱུར་ཏོ།
en: People were very pleased.

source: །ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་བཅོམ་ལྡན་འདས་ཡུལ་མ་ག་དྷཱར་གཤེགས་སོ་ཞེས་ཐོས་སོ། །ཐོས་ནས་ཀྱང་སྙིང་དགའ་བ་དང་། མགུ་བ་དང་། རབ་ཏུ་དགའ་བ་དང་། དགའ་བ་རྒྱ་ཆེན་པོ་དང་། ཡིད་བདེ་བ་སྐྱེས་ནས་བློན་པོ་རྣམས་ལ་སྨྲས་པ།
en: When Ajātaśatru, the king of Magadha, son of Vaidehī, heard that the Blessed One had come to the country of Magadha, he was pleased, he rejoiced, he was very pleased, he was highly pleased, and he felt happy.

source: ཤེས་ལྡན་དག་དེང་ལ་བཅོམ་ལྡན་འདས་ཀྱི་ཕྱིར་དཔག་ཚད་ཕྱེད་དང་གསུམ་གྱི་ལམ་བསྟར་བ་དང་། གྲོང་ཁྱེར་དག་བཟང་པོར་བྱོས་ཤིག །རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཐམས་ཅད་ཀྱང་རྡོ་བ་དང་། གསེག་མ་དང་། གྱོ་མོ་སོལ་ཏེ་ཙན་དན་གྱི་ཆུས་ཆག་ཆག་ཐོབ་ལ་དར་གྱི་ཆུན་འཕྱང་མང་པོ་དཔྱོངས་ཤིག །དྲི་ཞིམ་པོའི་པོག་ཕོར་དག་ཤོམས་ལ།
en: He instructed his ministers, “Sirs, today decorate the road for three and a half yojanas and beautify the cities for the sake of the Blessed One. In the whole city of Rājagṛha, remove the stones, pebbles, and gravel, sprinkle sandalwood water, and hang many silk tassels.

source: གདུགས་དང་། རྒྱལ་མཚན་དག་ཚུགས་ཤིག །བར་བར་དུ་མེ་ཏོག་གི་གཞལ་མེད་ཁང་མཛེས་པ་དག་བྱོས་ཤིག །ལྷ་བཀའ་བཞིན་འཚལ་ཞེས་བློན་པོ་རྣམས་ཀྱིས་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲའི་ལྟར་མཉན་ནས་ཐམས་ཅད་རྒྱས་པར་བྱེད་དུ་བཅུག་གོ།
en: Set out sweet-smelling censers and set up parasols and banners. At various intervals make beautiful houses of flowers.” “Certainly, Your Majesty,” replied the ministers to Ajātaśatru, the king of Magadha, son of Vaidehī, and they completed everything thoroughly.

source: །དེ་ནས་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་རྒྱལ་པོ་ཆེན་པོའི་འབྱོར་པ་དང་། རྒྱལ་པོ་ཆེན་པོའི་མཐུས་བདག་ཉིད་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་དང་བསུར་སོང་ངོ་། །དེ་ནས་བཅོམ་ལྡན་འདས་དུལ་བ་འཁོར་དུལ་བ། ཞི་བ་འཁོར་ཞི་བ་གྲོལ་བ་འཁོར་གྲོལ་བ། དབུགས་ཕྱིན་པ་འཁོར་དབུགས་ཕྱིན་པ། རྣམ་པར་དུལ་བ་འཁོར་རྣམ་པར་དུལ་བ། དགྲ་བཅོམ་པ་འཁོར་དགྲ་བཅོམ་པ། འདོད་ཆགས་དང་བྲལ་བ་འཁོར་འདོད་ཆགས་དང་བྲལ་བ། མཛེས་པ་འཁོར་མཛེས་པ། ཁྱུ་མཆོ
en: Then Ajātaśatru, the king of Magadha, son of Vaidehī, with the majesty of a great king and the power of a great king, went to meet the Blessed One by himself along with his army of four divisions. Then the Blessed One, who was self-controlled and followed by a self-controlled assembly, who was calm and followed by a calm assembly, who was peaceful and followed by a peaceful assembly, who was excellently self-controlled and followed by an excellently self-controlled assembly, who was an arhat and followed by an assembly of arhats, who was free from desire and followed by an assembly free from desire, who was beautiful and followed by a beautiful assembly, like a bull surrounded by bullocks, like an elephant surrounded by young elephants, like a lion surrounded by a pride of beasts, like a king of haṃsas surrounded by a flock of haṃsas, like a garuḍa surrounded by a flock of birds, like a brahmin surrounded by a group of his disciples, like an excellent physician surrounded by a group of patients, like a hero surrounded by a group of soldiers, like a guide surrounded by a group of visitors, like a caravan leader surrounded by a group of merchants, like a guild head surrounded by his kinsmen, like a minor king surrounded by a group of his ministers, like a wheel-turning king surrounded by his thousand sons, like the moon surrounded by the group of lunar mansions, like the sun surrounded by a thousand lights, like Dhṛtarāṣṭra surrounded by a group of gandharvas, like Virūḍhaka surrounded by a group of kumbhāṇḍas, like Virūpākṣa surrounded by a group of nāgas, like Vaiśravaṇa surrounded by a group of yakṣas, like Vemacitra surrounded by a group of asuras, like Śakra surrounded by the group of Thirty-Three Gods, like Brahmā surrounded by a group of gods attendant on Brahmā, like the immovable ocean, like a rain cloud, like the best of elephants free from rutting, exhibiting an undisturbed manner and behavior because his senses were completely restrained, fully ornamented with the thirty-two marks of a great man, illuminated by the eighty minor marks, ornamented with a fathom-wide halo, beautiful like a moving mountain of jewels with a radiance surpassing a thousand suns, and having the ten powers, four types of self-confidence, three unshared applications of mindfulness, and great compassion, arrived at the city of Rājagṛha followed by a large community of monks, Ajātaśatru the king of Magadha and son of Vaidehī, and hundreds of thousands of gods.

source: ག་བ་གླང་གི་ཚོགས་ཀྱིས་བསྐོར་བ་ལྟ་བུ། གླང་པོ་ཆེ་གླང་པོ་ཆེའི་ཕྲུ་གུའི་ཚོགས་ཀྱིས་བསྐོར་བ་ལྟ་བུ། སེང་གེ་མཆེ་བ་ཅན་གྱི་ཚོགས་ཀྱིས་བསྐོར་བ་ལྟ་བུ། ངང་པའི་རྒྱལ་པོ་ངང་པའི་ཚོགས་ཀྱིས་བསྐོར་བ་ལྟ་བུ། ནམ་མཁའ་ལྡིང་འདབ་ཆགས་ཀྱི་ཚོགས་ཀྱིས་བསྐོར་བ་ལྟ་བུ། བྲམ་ཟེ་སློབ་མའི་ཚོགས་ཀྱིས་བསྐོར་བ་ལྟ་བུ། སྨན་པ་མཁས་པ་ནད་པའི་ཚོགས་ཀྱིས་བསྐོར་བ་ལྟ་བུ། དཔའ་བོ་དམག་མིའི་ཚོགས་ཀྱིས་བསྐོར་བ་ལྟ་བུ། ལམ་མཁན་འགྲོན་པོའི་ཚོགས་ཀྱིས་བསྐོར་བ་ལྟ་བུ། དེད་དཔོན་ཚོང་པའི་ཚོགས་ཀྱིས་བསྐོར་བ་ལྟ་བུ། ཚོང་དཔོན་རང་གི་སྐྱེ་བོས་བསྐོར་བ་ལྟ་བུ། རྒྱལ་ཕྲན་བློན་པོའི་ཚོགས་ཀྱིས་བསྐོར་བ་ལྟ་བུ། འཁོར་ལོས་སྒྱུར་བ་བུ་སྟོང་གིས་བསྐོར་བ་ལྟ་བུ། ཟླ་བ་རྒྱུ་སྐར་གྱི་ཚོགས་ཀྱིས་བསྐོར་བ་ལྟ་བུ། ཉི་མ་འོད་ཟེར་སྟོང་གིས་བསྐོར་བ་ལྟ་བུ། ཡུལ་འཁོར་སྐྱོང་དྲི་ཟའི་ཚོགས་ཀྱིས་བསྐོར་བ་ལྟ་བུ། ལུས་འཕགས་པོ་གྲུལ་བུམ་གྱི་ཚོགས་ཀྱིས་བསྐོར་བ་ལྟ་བུ། མིག་མི་བཟད་ཀླུའི་ཚོགས་ཀྱིས་བསྐོར་བ་ལྟ་བུ། ནོར་སྦྱིན་གནོད་སྦྱིན་གྱི་ཚོགས་ཀྱིས་བསྐོར་བ་ལྟ་བུ། ཐགས་ཟངས་རིས་ལྷ་མ་ཡིན་གྱི་ཚོགས་ཀྱིས་བསྐོར་བ་ལྟ་བུ། བརྒྱ་བྱིན་སུམ་བཅུ་རྩ་གསུམ་པའི་ཚོགས་ཀྱིས་བསྐོར་བ་ལྟ་བུ། ཚངས་པ་ཚངས་རིས་ཀྱི་ཚོགས་ཀྱིས་བསྐོར་བ་ལྟ་བུ། རྒྱ་མཚོ་མི་གཡོ་བ་ལྟ་བུ། སྤྲིན་ཆུ་དང་བཅས་པ་ལྟ་བུ། གླང་པོ་ཆེ་དམ་པ་རྒྱགས་པ་དང་བྲལ་བ་ལྟར་དབང་པོ་རྣམས་ཤིན་ཏུ་དུལ་བས་མ་གཡེངས་པའི་སྤྱོད་ལམ་གྱི་སྤྱོད་པ་ཅན། སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་བཅུ་རྩ་གཉིས་ཀྱིས་ཀུན་ནས་བརྒྱན་པ། དཔེ་བྱད་བཟང་པོ་བརྒྱད་བཅུས་མཛེས་པར་བྱས་པ། སྐུ་འོད་འདོམ་གང་གིས་བརྒྱན་པ། ཉི་མ་སྟོང་གི་འོད་ཟེར་བས་ལྷག་པ། རིན་པོ་ཆེའི་རི་བོ་འགྲོ་བ་ལྟར་ཀུན་ནས་མཛེས་པ། སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། མ་འདྲེས་པ་གསུམ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཐུགས་རྗེ་ཆེན་པོ་དང་ལྡན་པ། དགེ་སློང་གི་དགེ་འདུན་རབ་ཏུ་མང་པོ་དང་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་དང་། ལྷ་བརྒྱ་སྟོང་ཕྲག་དུ་མས་ཞམ་རིང་བྱས་ཏེ་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་དུ་གཤེགས་སོ། །གང་གི་ཚེ་བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ཏུ་ཞུགས་ཏེ། མངོན་པར་འདུ་བྱེད་པ་དང་བཅས་པས་གྲོང་ཁྱེར་གྱི་སྒོའི་ཐེམ་པ་ལ་ཞབས་གཡས་པས་མནན་པ་དེའི་ཚེས་རྣམ་པ་དྲུག་ཏུ་གཡོས་པར་གྱུར་ཏེ།
en: At the moment the Blessed One entered Rājagṛha and, with a specific intention, placed his right foot on the threshold of the city gate, the great earth quaked in six ways.

source: ས་ཆེན་པོ་འདི་གཡོས། རབ་ཏུ་གཡོས། ཀུན་དུ་རབ་ཏུ་གཡོས།
en: This great earth quaked, quaked furiously, and quaked absolutely furiously.

source: ལྡེག་རབ་ཏུ་ལྡེག །ཀུན་དུ་རབ་ཏུ་ལྡེག་ཅིང་།
en: It roared, roared furiously, and roared absolutely furiously.

source: དབུས་མཐོ་ན་མཐའ་དམའ་བར་གྱུར་ཏོ།
en: When the middle rose, the periphery sank.

source: །འཇིག་རྟེན་འདི་འཇིག་རྟེན་གྱི་བར་དང་བཅས་པ་ཐམས་ཅད་ཀྱང་སྣང་བ་རྒྱ་ཆེན་པོས་གསལ་བར་གྱུར་ཏོ།
en: This whole world, along with the interstices between the worlds, was illuminated by a huge light.

source: །ལྷས་ཀྱང་བར་སྣང་ལ་རྔ་དག་བརྡུངས་སོ།
en: Gods beat drums in the air.

source: །ནམ་མཁའ་ལ་གནས་པའི་ལྷ་རྣམས་ཀྱིས་ནི་བཅོམ་ལྡན་འདས་ཀྱི་སྟེང་ནས་ལྷའི་མེ་ཏོག་ཨུཏྤ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་དང་། ཨ་ག་རུའི་ཕྱེ་མ་དང་། རྒྱ་སྤོས་ཀྱི་ཕྱེ་མ་དང་། གུར་ཀུམ་གྱི་ཕྱེ་མ་དང་། ཏ་མ་ལའི་ལོ་མའི་ཕྱེ་མ་དང་། ལྷའི་མེ་ཏོག་མན་དཱ་ར་བ་དང་། གོས་དག་འཐོར་བར་བྱེད་དེ།
en: Gods in the sky scattered divine flowers such as utpala, padma, kumuda, and puṇḍarīka; agaru powder, tagara powder, and powder from the tamāla leaf; divine mandārava flowers; and garments.

source: བཅོམ་ལྡན་འདས་གྲོང་ཁྱེར་དུ་གཤེགས་པ་ན་དེ་ལྟ་བུའི་ཡ་མཚན་དག་བྱུང་བར་གྱུར་ཏོ།
en: When the Blessed One came to the city, these wonders occurred.

source: །གཞན་ཡང་དོག་པ་དག་ནི་ཡངས་པར་གྱུར་ཏོ། །དམའ་བ་དག་ནི་མཐོ་བར་གྱུར་ཏོ། །མཐོ་བ་དག་ནི་ཕྱ་ལེ་བར་གྱུར་ཏོ།
en: In addition, narrow places became wide, low places rose, and high places sank;

source: །གླང་པོ་ཆེ་དག་ནི་སྐད་འབྱིན་པར་གྱུར་ཏོ། །རྟ་དག་ཀྱང་སྐད་འབྱིན་པར་གྱུར་ཏོ། །ཁྱུ་མཆོག་དག་ཀྱང་སྐད་འབྱིན་པར་གྱུར་ཏོ།
en: elephants roared, horses roared, and bulls also roared;

source: །ཁྱིམ་གྱི་ནང་ན་བཞག་པའི་སྣོད་སྣ་ཚོགས་དག་ནི་མ་བརྡུངས་པར་རང་སྒྲ་འབྱིན་པར་གྱུར་ཏོ།
en: various musical instruments in houses sounded of their own accord without being struck;

source: །ལོང་བ་རྣམས་ཀྱིས་ནི་མིག་ཐོབ་པར་གྱུར་ཏོ། །འོན་པ་རྣམས་ནི་རྣ་བས་ཐོས། ལྐུགས་པ་རྣམས་ནི་སྨྲ་ནུས་པར་གྱུར་ཏོ། །དབང་པོ་ལྷག་མ་མ་ཚང་བ་རྣམས་ནི་དབང་པོ་སོ་སོར་ཐོབ་པར་གྱུར་ཏོ། །ཆང་གིས་མྱོས་པ་རྣམས་ནི་མྱོས་པ་དང་བྲལ་བར་གྱུར་ཏོ།
en: blind people could see, deaf people could hear, mute people could speak, and those who had other imperfect faculties gained the perfection of each faculty;

source: །དུག་འཐུངས་པ་དག་ནི་དུག་ཞི་བར་གྱུར་ཏོ། །ཕན་ཚུན་ཁོན་བྱུང་བ་རྣམས་ནི་མཛའ་བར་གྱུར་ཏོ། །སྦྲུམ་པ་དག་ནི་བདེ་བར་བཙས་པར་གྱུར་ཏོ། །བཙོན་དུ་བཅིངས་པ་དག་ནི་ཐར་བར་གྱུར་ཏོ། །ནོར་མེད་པ་དག་ནི་ནོར་རྙེད་པར་གྱུར་ཏོ།
en: and the drunk became sober, those who had taken poison recovered from the effect of the poison, those who were angry with each other became friendly, pregnant women bore their children safely, those who had been confined in prison were freed, and those who lacked property obtained property.

source: །དེ་ལྟ་བུའི་འབྱོར་པ་དེ་མཐོང་ནས་དགེ་བསྙེན་ཞིག་གིས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Having seen such prosperity, a lay brother spoke this verse:

source: ཡུལ་གང་ཞིག་ཏུ་འཇིག་རྟེན་གཙོ་བོ་གཤེགས་པ་དེར།
en: “In the country where the Lord of the World appears,

source: །ལོ་ཉེས་མི་ངས་དང་ནི་ཕྱི་དགྲའི་འཇིགས་པ་མེད།
en: There are no crop failures, epidemics, or external attacks,

source: །ལྷ་རྣམས་ཆར་འབེབས་སྐྱེ་བོ་བསོད་ནམས་རབ་ཏུ་བྱེད།
en: The gods bring rain, people make merit,

source: །དེར་ནི་ཡ་མཚན་བརྒྱ་ཕྲག་གཞན་ཡང་འབྱུང་བར་འགྱུར།
en: And hundreds of wonders occur there.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ཏུ་ཞུགས་ཏེ།
en: Thereupon the Blessed One entered Rājagṛha and relieved the people.

source: སྐྱེ་བོའི་ཚོགས་དབུགས་ཕྱུང་ནས་རྒྱལ་པོའི་ཁབ་ནས་བྱུང་སྟེ་འོད་མའི་ཚལ་དུ་གཤེགས་སོ།
en: He then left Rājagṛha and entered the Bamboo Grove.

source: །དེ་ནས་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Then Ajātaśatru, the king of Magadha, son of Vaidehī, went to the Blessed One.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ལ་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཡང་དག་པར་སྟོན་པར་མཛད། ཡང་དག་པར་འཛིན་དུ་འཇུག་པར་མཛད། ཡང་དག་པར་གཟེངས་སྟོད་པར་མཛད་ཅེས་བྱ་བ་ནས་ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་ནས་ཅང་མི་གསུང་ངོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: When he had sat down to one side, the Blessed One, through talk consistent with the Dharma, instructed, inspired, encouraged, and delighted Ajātaśatru, the king of Magadha, son of Vaidehī, and was then silent.

source: །དེ་ནས་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་ལ་མངོན་པར་བསྟོད་དེ་རྗེས་སུ་ཡི་རངས་ནས་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས།
en: Ajātaśatru, the king of Magadha, son of Vaidehī, then praised and rejoiced in the words of the Blessed One.

source: བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ལ་བདག་གིས་དགུང་ཟླ་གསུམ་དུ་ན་བཟའ་ཆོས་གོས་དང་། བསོད་སྙོམས་དང་། གཟིམས་ཆ་དང་། སྙུན་དཔྱད་ཀྱི་རྐྱེན་སྨན་དང་། ཡོ་བྱད་རྣམས་འདུལ་ཞིང་མཆིས་ན་གནང་བར་མཛད་དུ་གསོལ།
en: He rose from his seat, draped his upper robe over one shoulder, made the gesture of supplication to the Blessed One, and said to the Blessed One, “May the Blessed One together with the community of monks assent to my offer of the requisites for three months, namely, robes, almsfood, bedding and seats, and medicines for the sick.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་།
en: The Blessed One gave his assent to Ajātaśatru, the king of Magadha, son of Vaidehī, by remaining silent.

source: །དེ་ནས་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་སྟན་ལས་ལངས་ཏེ་སོང་ངོ་།
en: Then Ajātaśatru, the king of Magadha, son of Vaidehī, knowing that the Blessed One had assented by remaining silent, bowed low until his forehead touched the Blessed One’s feet, rose from his seat, and departed.

source: །བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་ཟླ་བ་གསུམ་དུ་ན་བཟའ་ཆོས་གོས་དང་། བསོད་སྙོམས་དང་། གཟིམས་ཆ་དང་། སྙུན་དཔྱད་ཀྱི་རྐྱེན་སྨན་དང་། ཡོ་བྱད་རྣམས་ཀྱིས་བསྙེན་བཀུར་བྱས་སོ།
en: The Blessed One with the community of monks was then provided by Ajātaśatru, the king of Magadha, son of Vaidehī, with the requisites, namely, robes, almsfood, bedding and seats, and medicines for the sick, for three months. B. The Epidemic in Vaiśālī

source: །དེ་ནས་སངས་རྒྱས་ལ་མངོན་པར་དགའ་བའི་ལྷ་རྣམས་ཀྱིས་མི་ངས་དེ་བསྐྲད་ནས་རྒྱལ་པོའི་ཁབ་ནས་བྱུང་ནས་སྒྲ་སྒྲོགས་ཞེས་བྱ་བའི་ནང་དུ་བྱུང་སྟེ།
en: After that, the epidemic was eradicated by the gods who had faith in the Buddha;

source: ཡངས་པ་ཅན་དུ་འདུག་ནས།
en: it left Rājagṛha but appeared in a place named Guṃjika.

source: ཡངས་པ་ཅན་གྱི་སྐྱེ་བོའི་ཚོགས་ལ་མི་ངས་བྱུང་བར་གྱུར་ཏེ། ཁྱོགས་དང་ཁྱོགས་འདྲུད་པར་གྱུར་ཏོ།
en: When it entered Vaiśālī, the people of Vaiśālī suffered from the epidemic and funeral biers jostled one another.

source: །ཡངས་པ་ཅན་ན་བྲམ་ཟེ་མདུན་ན་འདོན་མདའ་བོ་ཆེ་ཞེས་བྱ་བ་ཞིག་གནས་པ་དེའི་རྨི་ལམ་ན་ཡངས་པ་ཅན་ན་གནས་པའི་ལྷ་ཞིག་གིས་སྨྲས་པ།
en: There was a brahmin in Vaiśālī named Tomara, who was the chief priest of the country. In a dream, a god living in Vaiśālī said:

source: གལ་ཏེ་མི་འདུལ་ཁ་ལོ་སྒྱུར་བའི་མཆོག །ཤཱཀྱའི་རིགས་དག་པ་ཡི་བཅོམ་ལྡན་འདས།
en: “If the Blessed One, the supreme tamer of people to be tamed, The joy of the lineage of the Śākyans,

source: །ཡངས་པ་ཅན་དུ་གཤེགས་པར་གྱུར་ན་ནི།
en: Comes to Vaiśālī,

source: །གནོད་པ་རྣམས་ནི་རྣམ་པར་འཇིག་པར་འགྱུར།
en: Harm will cease.”
